Revit 2024 API
BuiltInFailures.SketchFailures.PathCannotBeClosedLoopPath3d Property
 Path cannot be a closed loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PathCannotBeClosedLoopPath3d { get; }
Visual Basic
Public Shared ReadOnly Property PathCannotBeClosedLoopPath3d As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PathCannotBeClosedLoopPath3d {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace